driver-tests/bpelse/assign/AssignJbi/test/results/echoTokenDataType_Invoke/Actual_20130318180059_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <item xmlns="http://stc.com/echoTokenDataType" xmlns:msgns="http://stc.com/echoTokenDataType">
      <string>token</string>
      <normalizedString>token</normalizedString>
      <token>token</token>
      <base64Binary>token</base64Binary>
      <hexBinary>token</hexBinary>
      <integer>token</integer>
      <positiveInteger>token</positiveInteger>
      <negativeInteger>token</negativeInteger>
      <nonNegativeInteger>token</nonNegativeInteger>
      <nonPositiveInteger>token</nonPositiveInteger>
      <long>token</long>
      <unsignedLong>token</unsignedLong>
      <int>token</int>
      <unsignedInt>token</unsignedInt>
      <short>token</short>
      <unsignedShort>token</unsignedShort>
      <byte>token</byte>
      <unsignedByte>token</unsignedByte>
      <decimal>token</decimal>
      <float>token</float>
      <double>token</double>
      <boolean>token</boolean>
      <duration>token</duration>
      <dateTime>token</dateTime>
      <date>token</date>
      <time>token</time>
      <gYear>token</gYear>
      <gYearMonth>token</gYearMonth>
      <gMonth>token</gMonth>
      <gMonthDay>token</gMonthDay>
      <gDay>token</gDay>
      <Name>token</Name>
      <QName>token</QName>
      <NCName>token</NCName>
      <anyURI>token</anyURI>
      <language>token</language>
      <ID>token</ID>
      <IDREF>token</IDREF>
      <IDREFS>token</IDREFS>
      <ENTITY>token</ENTITY>
      <ENTITIES>token</ENTITIES>
      <NMTOKEN>token</NMTOKEN>
      <NMTOKENS>token</NMTOKENS>
    </item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>